{
    'diagram_acp':
        {
            'hint':
                {
                    'rus': 'Лидеры рынка',
                },
            'blocks': 'Process',
            'gui_name':
                {
                    'rus': 'Лидеры рынка',
                },
            'in_params':
                {
                    'dataset':
                        {
                            'gui_name':
                                {
                                    'rus': 'Датасет',
                                },
                        },
                    'code':
                        {
                            'gui_name':
                                {
                                    'rus': 'Товар',
                                },
                            'gui_type': 'select',
                            'gui_select_values':
                                {
                                    'rus': ['803901000', '803', '8039', '80390100',
                                            '80390', '805501000', '805', '80550', '80550100',
                                            '0702000001', '0702000002','0702000003', '0702000004',
                                            '0702000005', '0702000006', '0702000007', '0702000009'
                                            ]
                                },
                            'ds_values':
                                {
                                    'rus': ['803901000', '803', '8039', '80390100',
                                            '80390', '805501000', '805', '80550', '80550100',
                                            '0702000001', '0702000002','0702000003', '0702000004',
                                            '0702000005', '0702000006', '0702000007', '0702000009'
                                            ]
                                }
                        },
                    'time_start':
                        {
                            'gui_name':
                                {
                                    'rus': 'Дата начала (YYYY-MM-DD)',
                                },
                            'gui_type': 'input',
                            'gui_default_values':
                                {
                                    'rus': ''
                                },
                        },
                    'time_end':
                        {
                            'gui_name':
                                {
                                    'rus': 'Дата окончания (YYYY-MM-DD)',
                                },
                            'gui_type': 'input',
                            'gui_default_values':
                                {
                                    'rus': ''
                                },
                        },
                },
        },
}
